Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/witnesses/the_procedure_for_being_a_witness.html.txt.tmx
Source language: en
Languages: ga

source: The procedure for being a witness
ga: An modh le bheith i d'fhinné

source: There are some situations where you may be able to give evidence by video-link instead of coming into the court
ga: D'fhéadfadh sé i gcúinsí faoi leith go mbeadh tú in ann fianaise a thabhairt le nasc físe in áit a theacht isteach i seomra na cúirte

source: At the trial, you may be one of a number of witnesses who are going to give evidence
ga: Ag an triail, d'fhéadfadh sé gur duine thú i measc finnéithe eile a bheidh ag tabhairt fianaise

source: Normally you will wait in the court and you may watch the trial until it is your turn to give evidence
ga: Is iondúil go mbíonn tú in ann fanacht sa chúirt agus breathnú ar a bhfuil ag tarlú sa triail go dtí go mbíonn ort féin fianaise a thabhairt

source: Sometimes you may be asked to leave the court and if that happens, you will be told when to return
ga: Amanna iarrfar ort an chúirt a fhágáil agus má tharlaíonn seo inseofar duit nuair is féidir leat a theacht ar ais

source: When it is your turn, the solicitor or barrister for the party who called you as a witness will stand up and will name you as the next witness
ga: Nuair a thagann sé chugat féin, seasfaidh an dlíodóir nó abhcóide don té a ghlaoigh ort mar fhinné agus ainmneoidh sé/sí thú mar an gcéad fhinné eile

source: You will walk up to the front of the court and go into the witness box
ga: Siúlfaidh tú suas chuig barr na cúirte agus rachaidh tú isteach i mbosca an fhinné

source: In civil proceedings, the court may give anonymity to a witness where the witness has a medical condition and being identified as having that condition would cause undue stress to the witness
ga: Seasfaidh tú i mbosca an fhinné agus tabharfaidh cláraitheoir na cúirte

source: You will stand in the witness box and the court registrar will hand you a Bible, which you must hold
ga: Bíobla duit nach mór duit a choinneáil i do lámh

source: The registrar will then ask you to repeat the following oath after him/her, "I swear by Almighty God that the evidence I shall give shall be the truth, the whole truth and nothing but the truth"
ga: Iarrfaidh an cláraitheoir ansin ort an mionn a athrá ina d(h)iaidh focail mar seo a leanas atá i gceist, "Mionnaím do Dhia Uilechumhachtach gurb í an fhirínne, an fhírinne ghlan gan tada ach an fhírinne a bheidh i mo chuid fianaise"

source: If you wish to make the affirmation (suitable for those who are not Christians), then you must tell the registrar
ga: Más mian leat an dearbhú a dhéanamh (atá feiliúnach do dhaoine nach Críostaithe iad), ní mór é sin a chur in iúl don chláraitheoir

source: The words of the affirmation are "I, do solemnly, sincerely and truly declare and affirm that the evidence that I shall give shall be the truth, the whole truth and nothing but the truth"
ga: Focail den chineál seo a leanas atá i gceist "Mionnaím go sollúnta, go dílis agus go fírinneach gurb í an fhirínne, an fhírinne ghlan gan tada ach an fhírinne a bheidh i mo chuid fianaise"

source: When you have repeated your oath or affirmation, you will sit down
ga: Nuair atá an mionn nó dearbhú athráite agat suífidh tú síos

source: The solicitor or barrister for the party who has called you as a witness will then ask you a series of questions to allow you to give your evidence
ga: Cuirfidh an dlíodóir nó abhcóide don té a ghlaoigh ort mar fhinné ceisteanna ansin ort le deis a thabhairt duit d'fhianaise a thabhairt

source: This is called the "examination in chief"
ga: Tugtar an príomhscrúdú air seo

source: The questions that you are asked at this stage are designed to guide you through your evidence so that you can give your account of what happened in your own words
ga: Tá na ceisteanna a fhreagraíonn tú ag an bpointe seo curtha ar bhealach le treoir a thabhairt duit fianaise a thabhairt i d'fhocail féin ar an méid a tharla

source: You should carefully consider each question and answer it truthfully
ga: Ba cheart duit machnamh a dhéanamh ar gach ceist agus í a fhreagairt go fírinneach

source: During the examination in chief, you cannot be asked "leading questions"
ga: Ní féidir ceisteanna treoracha a chur ort le linn an phríomhscrúdaithe

source: These are questions that suggest the answer
ga: Is ceisteanna iad seo a thugann leide don fhreagra

source: For example, you cannot be asked "Did you see Mr
ga: Mar shampla, ní féidir iarraidh ort "An bhfaca tú an tUasal X ag dul trasna an bhóthair?

source: X cross the road? " but you may be asked "What did you see Mr. X do?
ga: " ach is féidir an cheist seo a chur ort "Céard a chonaic tú an tUasal X ag déanamh?

source: After the examination in chief, the solicitor or barrister for the other side will stand up and will ask you a series of questions
ga: Tar éis an phríomhscrúdaithe seasfaidh an dlíodóir nó abhcóide don taobh eile le ceisteanna a chur ort

source: This is called the "cross-examination"
ga: Tugtar croscheistiú air seo

source: The purpose of the cross-examination is to allow the other side to attempt to undermine or reduce the significance of your evidence
ga: Tá sé mar aidhm ag an gcroscheistiú deis a thabhairt don taobh eile iarracht a dhéanamh bonn a bhaint ó thábhacht d'fhianaise nó é a laghdú

source: You may be asked questions designed to make you seem unreliable, mistaken, confused or untruthful as a witness
ga: D'fhéadfadh sé go gcuirfí ceisteanna ort le taispeáint go bhfuil tú gan iontaoibh, mícheart, go bhfuil mearbhall ort, nó go bhfuil tú bréagach mar fhinné

source: Contradictions in your evidence may be pointed out to you and you may be asked to explain those contradictions
ga: D'fhéadfaí aon chuid de d'fhianaise atá ag dul in aghaidh cuid eile a phiocadh amach agus iarrfar ort na rudaí sin a mhíniú

source: During the cross-examination, you may be asked leading questions
ga: Is féidir ceisteanna treoracha a chur ort agus tú dhá chroscheistiú

source: When the cross-examination is over, the solicitor or barrister for the party who called you as a witness may choose to conduct a "re-examination"
ga: Nuair atá an croscheistiú déanta d'fhéadfadh an dlíodóir nó abhcóide don té a ghlaoigh ort mar fhinné athscrúdú a dhéanamh ort

source: This means that you will be asked more questions designed to clarify any issues that arose during the cross-examination
ga: Cuirfear tuilleadh ceisteanna ort le rudaí a tháinig aníos nuair a bhí tú dhá chroscheistiú a shoiléiriú

source: During the re-examination, you cannot be asked leading questions
ga: Ní féidir aon cheisteanna treoracha a chur ort le linn an athscrúdaithe

source: At any time while you are in the witness box, the judge may ask you questions or ask you to clarify certain matters
ga: Is féidir leis an mbreitheamh, ag am ar bith nuair atá tú sa bhosca finné, ceisteanna a chur ort nó iarraidh ort rudaí faoi leith a shoiléiriú

source: When the cross-examination and/or re-examination is over, you will be asked to leave the stand
ga: Nuair atá deireadh leis an gcroscheistiú agus/nó leis an athscrúdú, iarrfar ort an seastán a fhágáil

source: Normally that is the end of your involvement in the case
ga: Is iondúil nach mbíonn aon bhaint eile agat leis an gcás

source: However, sometimes you may be asked to come back to court to give more evidence
ga: Ach, amanna d'fhéadfaí iarraidh ort a theacht ar ais sa chúirt le tuilleadh fianaise a thabhairt

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
